simulation/filling_simulation_20250413_120420/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  12
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.07949987798929214 -0.40595996379852295 -0.583798885345459)
    (0.09449987858533859 -0.40595996379852295 -0.583798885345459)
    (0.09449987858533859 0.10835956037044525 -0.583798885345459)
    (-0.07949987798929214 0.10835956037044525 -0.583798885345459)
    (-0.07949987798929214 -0.40595996379852295 0.12419979274272919)
    (0.09449987858533859 -0.40595996379852295 0.12419979274272919)
    (0.09449987858533859 0.10835956037044525 0.12419979274272919)
    (-0.07949987798929214 0.10835956037044525 0.12419979274272919)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1 )
);

boundary
(
    walls
    {
        type patch;
        faces
        (
            (0 3 2 1)  // bottom face
            (4 5 6 7)  // top face
            (0 1 5 4)  // front face
            (1 2 6 5)  // right face
            (3 7 6 2)  // back face
            (0 4 7 3)  // left face
        );
    }
);

mergePatchPairs
(
    // Optional: specify any patch merging if needed
);
