simulation/filling_simulation_20250413_120420/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          28;
        startFace       79726;
    }
    riser
    {
        type            patch;
        nFaces          47;
        startFace       79754;
    }
    model
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          21027;
        startFace       79801;
    }
)

// ************************************************************************* //
