simulation/filling_simulation_20250413_120420/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

turbulenceDamping
{
    type            compressible::VoFTurbulenceDamping;

    delta           1e-4;
}

injection
{
    type            massSource;
    
    phase           metal;
    
    select          cellSet;
    cellSet         massSource;
    
    massFlowRate    1.2;  
}
//************************************************************************* //
