simulation/filling_simulation_20250413_120420/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            zeroGradient;
    }

    // inlet
    // {
    //     type            inletOutlet;
    //     inletValue      $internalField;
    // }
    riser
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
}

sources
{
    injection
    {
        type            uniformFixedValue;
        uniformValue    1000;
    }
}


// ************************************************************************* //
