simulation/filling_simulation_20250413_120420/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    // Create face sets for each patch
    {
        name    allFaces;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name inlet;
        }
    }

    {
        name    allFaces;
        type    faceSet;
        action  add;
        source  patchToFace;
        sourceInfo
        {
            name riser;
        }
    }

    {
        name    allFaces;
        type    faceSet;
        action  add;
        source  patchToFace;
        sourceInfo
        {
            name model;
        }
    }

    // Convert face sets to cell sets
    {
        name    fluidCells;
        type    cellSet;
        action  new;
        source  faceToCell;
        sourceInfo
        {
            set     allFaces;
            option  any;
        }
    }

    // Convert cell set to cell zone
    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set fluidCells;
        }
    }

    // ADD THIS SECTION: Create inlet cells set for mass source
    {
        name    inletFaces;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name inlet;
        }
    }

    {
        name    massSource;
        type    cellSet;
        action  new;
        source  faceToCell;
        sourceInfo
        {
            set     inletFaces;
            option  owner;  // Use cells that own the faces (inside the domain)
        }
    }
);